
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)

	//Запуск задания
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("Период", Объект.Период);
	
	ДлительнаяОперация = ВыполнитьДлительнуюОперациюНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);

	//настройка оповещений
	ОповещениеЗавершениеДлительнойОперации = Новый ОписаниеОповещения("ОповещениеЗавершениеДлительнойОперации", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал = 1;
			
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеЗавершениеДлительнойОперации, ПараметрыОжидания);
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьДлительнуюОперациюНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.КлючФоновогоЗадания = "СозданиеДокументов";
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Создание документов'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор);

	Результат = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьАкты", ПараметрыЗапуска);
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ОповещениеЗавершениеДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Результат.ПодробноеПредставлениеОшибки;
		Сообщение.Сообщить();
	КонецЕсли;
		 
	ПриЗавершенииРасчета(Результат.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗавершенииРасчета(Результат)
	ТЗСозданныеАкты = ПолучитьИзВременногоХранилища(Результат);
	Объект.СозданныеАкты.Загрузить(ТЗСозданныеАкты);
	
КонецПроцедуры	
#КонецОбласти
