
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	Для Каждого Строка Из Объект.Начисления Цикл
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад ИЛИ 
			Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Процент Тогда
			Строка.ДатаНачала = НачалоМесяца(Объект.Дата);
			Строка.ДатаОкончания = КонецМесяца(Объект.Дата);
		КонецЕсли;
	КонецЦикла;
			
КонецПроцедуры


#КонецОбласти
