
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДиаграммыГантаВДокументе = Параметры.Адрес;

	ТЗДиаграмма = ПолучитьИзВременногоХранилища(АдресДиаграммыГантаВДокументе);
	ОтобразитьДиаграммуГанта(ТЗДиаграмма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтобразитьДиаграммуГанта(Таблица)
	Серия = ДиаграммаГанта.УстановитьСерию("Отпуска");
	
	Для Каждого Строка Из Таблица Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
