
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Функция СоздатьАкты(ПараметрыЗапуска) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка,
		|	ДоговорыКонтрагентов.Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент
		|ПОМЕСТИТЬ ВТ_Договоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договоры.Ссылка КАК Договор,
		|	ВТ_Договоры.Организация КАК Организация,
		|	ВТ_Договоры.Контрагент КАК Контрагент
		|ИЗ
		|	ВТ_Договоры КАК ВТ_Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбработкаЗаказов.Обороты(&НачалоПериода, &КонецПериода,,) КАК
		|			ОбработкаЗаказовОбороты
		|		ПО ВТ_Договоры.Ссылка = ОбработкаЗаказовОбороты.Договор
		|ГДЕ
		|	ОбработкаЗаказовОбороты.Договор ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПараметрыЗапуска.Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПараметрыЗапуска.Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВсегоЗаписей = ВыборкаДетальныеЗаписи.Количество();
	ТекЗапись = 1;
	
	ТЗАкты = Новый ТаблицаЗначений;
		ТЗАкты.Колонки.Добавить("Контрагент");
		ТЗАкты.Колонки.Добавить("Договор");
		ТЗАкты.Колонки.Добавить("Документ");
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//создание документа Расходная Накладная
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата = КонецМесяца(ПараметрыЗапуска.Период);
		НовыйДокумент.Комментарий = "Документ создан автоматически обработкой";
		ПараметрыЗаполнения = Новый Структура();
		ПараметрыЗаполнения.Вставить("Организация", ВыборкаДетальныеЗаписи.Организация);
		ПараметрыЗаполнения.Вставить("Контрагент", ВыборкаДетальныеЗаписи.Контрагент);
		ПараметрыЗаполнения.Вставить("Договор", ВыборкаДетальныеЗаписи.Договор);
		
		НовыйДокумент.Заполнить(ПараметрыЗаполнения);
		НовыйДокумент.ВыполнитьАвтозаполнение(ВыборкаДетальныеЗаписи.Договор);
		НовыйДокумент.ПроверитьЗаполнение();
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
	//заполнение таблицы
		
		НоваяСтрокаТЗ = ТЗАкты.Добавить();
		НоваяСтрокаТЗ.Договор = ВыборкаДетальныеЗаписи.Договор;
		НоваяСтрокаТЗ.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		НоваяСтрокаТЗ.Документ = НовыйДокумент.Ссылка; 
				
	//подсчет процента выполнения
		ПроцентВыполнения = (ТекЗапись / ВсегоЗаписей) * 100;	
		ПроцентВыполнения = Окр(ПроцентВыполнения, 0);
		
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, СокрЛП(НовыйДокумент.Ссылка));
		
		ТекЗапись = ТекЗапись + 1;
	КонецЦикла;
		
	Возврат ТЗАкты;
	
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#КонецЕсли
